package Lesson9;
//Написать функцию, которая создает двумерный массив с таблицей умножения
//Размер таблицы должен быть параметром функции

import java.util.Scanner;

public class ArrayMultiplicationTable {
    /*private static int getArray(int tableSize) {
        int[][] array = new int[tableSize][tableSize];

        for (int i = 0, int j = 0; i<array[].lenght ; i++, j++){


        }


        return;
    }*/

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.println("Введите размер таблицы:");
        int tableSize = scanner.nextInt();

        //getArray(tableSize);
    }
}
